The  AnalysisDisplayVectorSettings  type exposes the following members.
 Properties
Name  |   Description
ArrowheadScale
 Type of arrow head scaling.
ArrowLineWeight
 Line weight assigned to arrow lines for vectors.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Rounding
 Increment to which numeric values of analysis results are rounded in vectors.
TextTypeId
 Element id of text associated with the settings.
VectorOrientation
 Vector orientation.
VectorPosition
 Vector position.
VectorTextType
 Type of vector text visualization.
 See Also
  AnalysisDisplayVectorSettings Class
  Autodesk.Revit.DB.Analysis Namespace